#第1前沿
X=[-0.7106]
Y=[0.132]

#第2前沿
X=[-1.022, -0.6825, -0.4051]
Y=[0.3344, 0.1804, 0.1328]
#
#
# #第3前沿
X=[-0.8343, -0.7674, -0.5788, 0.1905]
Y=[0.3579, 0.3251, 0.1856, 0.0985]
#
# #第4前沿
X=[-0.7444, -0.5612, -0.2546, 0.1537]
Y=[0.3352, 0.2072, 0.1732, 0.1488]
#
# #第5前沿
X=[-0.7352, -0.6551, -0.4651]
Y=[0.3898, 0.3271, 0.1973]
#
#
# #第6前沿
X=[-0.7304, -0.5245, -0.4633, 0.4001]
Y=[0.4146, 0.297, 0.2097, 0.1253]
#
# #第7前沿
X=[-0.7233, -0.6629, -0.4435, 0.1819, 0.4278]
Y=[0.4198, 0.3742, 0.2322, 0.1653, 0.1281]
#
# #第8前沿
X=[-0.6493, -0.529, -0.4434, 0.46]
Y=[0.3797, 0.3357, 0.2399, 0.1333]
#
# #第9前沿
X=[-0.7115, -0.6573, -0.6406, -0.4365, -0.3954, 0.0514, 0.5399]
Y=[0.4736, 0.3936, 0.3861, 0.2628, 0.2422, 0.2022, 0.1307]
#
#
# #第10前沿
X=[-0.6343, -0.5008, -0.4642, -0.4305, -0.385, 0.0713, 0.5815]
Y=[0.3872, 0.3453, 0.3422, 0.2798, 0.2558, 0.2069, 0.1641]

import csv


def write_to_csv(X, Y, filename):
    assert len(X) == len(Y), "X and Y must have the same length"

    with open(filename, 'a', newline='') as csvfile:
        csvwriter = csv.writer(csvfile)

        # Write header row if needed
        csvwriter.writerow(['X', 'Y'])  # Optional: write header if X and Y need headers

        # Write rows
        for i in range(len(X)):
            csvwriter.writerow([X[i], Y[i]])



filename = 't_data.csv'

write_to_csv(X, Y, filename)



